Revit 2024 API
ExternalResourceLoadContext Members
The ExternalResourceLoadContext type exposes the following members.
Methods
Name | Description
CallingDocumentHasModelPath
 Indicates whether the document requesting the external resource has a defined ModelPath.
Dispose
Releases all resources used by the ExternalResourceLoadContext
Equals
Determines whether the specified Object is equal to the current Object.
 (Inherited from Object.)
GetCallingDocumentModelPath
 Returns a copy of the ModelPath of the document that is requesting the external resource.
GetCurrentlyLoadedReference
 Returns a copy of the ExternalResourceReference currently in use by the containing element.
GetHashCode
Serves as a hash function for a particular type.
 (Inherited from Object.)
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
Properties
Name | Description
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
LoadOperationType
 An enum value indicating whether the resource load was triggered by an automatic event (such as file open) or an explicit user action.
See Also
ExternalResourceLoadContext Class
Autodesk.Revit.DB Namespace